[
    {
        "id": "20200611",
        "author": "Erica Ngao",
        "title" : "15 Canadian Brands Donating Proceeds to Fight Anti-Black Racism",
        "description" : "In addition to shopping from Black-owned businesses, calling on major retailers to pledge 15 percent of shelf space to Black-owned businesses and donating directly to Black organizations and groups in Canada, you can also choose to shop from brands that are donating proceeds from their sales to groups fighting anti-Black racism. Here’s a list of Canadian designers, brands and shops that are currently donating part or all of their sales. The Canadian designer will be donating 20 percent of net sales to the NAACP, the United State’s largest grassroots-based civil rights organization.",
        "page" : "https://www.ellecanada.com/fashion/shopping/canadian-brands-donating-proceeds-from-sales-to-fight-racism",
        "image" : "http://localhost:8080/log/branddonating.jpg",
        "date": "JUN 4 2020"

    },
    {
        "id": "20200610",
        "author": "Erica Ngao",
        "title" : "Indigenous Fashion Week Toronto Partners With Simons on Capsule Collection",
        "description" : "The myth of the lone genius continues to prevail in the fashion world, but Sage Paul is turning that notion on its head. During her childhood in a mostly Indigenous community (she is an urban Denesuliné tskwe and a member of the English River First Nation), the moms would gather the kids together for lessons in making traditional regalia and crafts. For the artist and designer, that sense of community is the anchor in everything she does – and she does a lot. From working on costumes for award-winning choreographer Nova Bhattacharya to teaching a course on contemporary Indigenous fashion (which she also created) at her alma mater, Paul is always looking for ways to make things fit together. The next piece of the puzzle? Indigenous Fashion Week Toronto (IFWTO), a multi-day showcase of fashion and art of which Paul is a co-founder and the artistic director. Although it’s currently postponed due to the pandemic, the event is far from your traditional fashion week. In addition to four runway shows (featuring 23 designers from Canada and abroad), there’s a marketplace, an art exhibit, lectures and workshops. “I really wanted an artistic platform that respects and values the work that designers create,” says Paul. In this spirit, the chosen designers are paid artist fees rather than the other way around.",
        "page" : "https://www.ellecanada.com/fashion/shopping/indigenous-fashion-week-toronto-simons-capsule-collection",
        "image" : "http://localhost:8080/log/indifw.jpg",
        "date" : "MAY 28 2020"
    },
    {
        "id": "20200609",
        "author": "Margaret Zhang",
        "title" : "How Do You Like Your Eggs?",
        "description" : "This is a film that I wrote as a short as a tonal test for another short that I’d like to shoot as a feature. Said everyone in LA ever. I jest. The other short is to be set in Georgia (the country, not the state), but I first wanted to see how many bodies would make a room feel crowded without or without puffer jackets; how long of a continuous shot I could get away with without the money for a track; how strange lines would sound in English when they were intended to be English language subtitles translated from something Kartvelian. Meanwhile, I’ve had a bloody weird year. Through its bizarre professional and personal interactions, I’ve sat on this internal dialogue on the notion of art and “art” and value and “value” that are not what they seem whichever way you look at them. On the one hand, I do want to believe that a The Work can still Speak For Itself. And yet, the more I work, the more those words have morphed to look like: The Work May Speak Only When Spoken To. This is not even about creative output and its reception being subjective. It’s about the existence of The Work, not The Work Itself. Most people won’t even look at The Work Itself. Years ago in Hong Kong, when my hair was still black (indeed, the timeline of my life is defined by my stages of hair evolution), I attended a gala with a capital G in an updo (an updo), dark lipstick, floral silk pants. The latter part of the evening boasted an art auction in the name of AIDS research (noble, indeed – donate here). The likes of Uma Thurman, Michelle Rodriquez and Tracey Emin stood before a room of well-coifed, well-postured folk to rally dollars and more dollars. Let me preface the following by saying that I don’t often get starstruck – at least not in the realm of your Victoria Beckhams, your Lang Langs, et cetera. I did once quietly lose my shit about neurosurgeon Charles Teo being in my HIIT gym class back in Sydney. But on the most part, celebrity is a stressful concept to me, as I’m sure it is to the celebrities themselves, so I keep my distance. And yet, here was Tracey Emin, a stoic vision on a conference hall stage in steamy Hong Kong. Tracey fucking Emin, standing beside one of her neon sculptures. You know the ones. It said something about the things we do for love or “love” in her slanted scrawl, as they usually do. But most of the room didn’t know that. Because most of the room was either drunk or didn’t know what Tracey Emin looked like. I’ll come and install it myself, declared Tracey Emin as the bidding stalled. How could people not be clamouring for Tracey Emin’s work? I’ll add a name, declared Tracey Emin. Whatever name you want. “The things we do for the love of [insert name here]”. And I’ll come and install it myself. Of the two times in my life that I remember wishing I could time-travel forward to some Future Time where I would presumably have more money, and bring it back to buy something that would reap far greater value and “value” at said Future Time, this was one of them. The other time was a Dion Lee blazer from Spring/Summer 2009 with cutout elbows. It was $150 and I was 16. I’ve told Dion since. He laughed and said he never wanted to see that blazer again. Fair enough. Meanwhile, back in Hong Kong, Tracey Emin’s work went for a figure that did not do it justice and Adrien Brody’s painting of a red dragon fetched four times the price. It’s Adrien Brody! A girl at my table whispered urgently and waved a diamond finger at the stage where Adrien Brody stood with his painting of a red dragon. I turned to the designer to my left. He’s not even going to install it himself! The designer shrugged. It’s Adrien Brody, he said. No shade to Adrien Brody, though. You know how I feel about a Chopin Nocturne and a certain Luca Changretta. The following year, I sat between a fine art dealer and a drag queen at a birthday dinner in Paris. The room had criminally high ceilings and the conversation drifted back to Hong Kong and the stunning aforementioned.",
        "page" : "https://margaretzhang.com.au/2019/10/how-do-you-like-your-eggs-film/",
        "image" : "http://localhost:8080/log/mz.jpg",
        "date" : "OCT 10, 2019"
    },
    {
        "id": "20200608",
        "author": "Caitlin Agnew",
        "title" : "Bermuda Shorts Are Your New Summer Wardrobe Staple",
        "description" : "This summer, it seems like there are Bermuda shorts for all – and all are for Bermuda shorts. Trotted out in khaki at The Row, in fuchsia at Valentino and in a soft lavender at Max Mara, this modest style is a great equalizer, wearing surprisingly well on soccer moms, dads with dad bods and their kids – not to mention hype-obsessed gen-Zers, who sport it along with their bucket hats and Balenciaga sneakers. These shorts, it seems, are an objectively democratic style fit for a world in which the traditional concepts of formality, age and gender seem increasingly irrelevant and outdated. Though they feel particularly fresh these days, Bermuda shorts, like many enduring wardrobe staples such as the bomber jacket and cargo pants, actually started out around a century ago as military gear. As the story goes, British officers stationed in Bermuda during the First World War cut their pants into shorts to beat the heat. This hack caught on and was refined over the years into a style that has since been worn by everyone from Marlene Dietrich to Barack Obama.In its latest iteration, the functional favourite has finally gone high fashion. Sported by the trendsetting Hadids, Jenners and Kardashians, today’s styles rise above casual cotton, coming in luxe satins and leathers. Montreal-based fashion platform Ssense, for example, boasts a variety of Bermuda-style shorts, ranging from an accessible Levi’s 501 take to Givenchy’s $1,450 forest-green pair, which come embellished with a dainty gold chain. Brigitte Chartrand, vice-president of womenswear buying at Ssense, says she noticed knee-length denim cut-offs start to pick up in popular- ity on the site a couple of years ago, right around the time when Justin Bieber started donning the then hard-to-love style. “Now, we’re investing in more elevated approaches as well,” she says of haute versions by Bottega Veneta, Acne Studios and Nanushka. “Today, they strike a balance between casual and dressy elements.”Designer Tanya Taylor is also embracing the silhouette, introducing cheerful bubble-gum-pink Bermuda shorts and a matching blazer this season. “I wanted to give women something they could wear to work but that would still be cool paired with sneakers for the weekends,” says Taylor. Worried that the shorts’ mid-thigh cut-off is hard to wear? “Like anything, it’s all about the fit, and not every length is going to work for everyone’s body,” says Taylor. So try different styles, and don’t hesitate to visit your tailor for tweaks. But while Bermudas may be the go-to go-everywhere look for summer, it’s wise to err on the side of formality – unless your goal is to channel the functional outdoorsy-ness of the shorts Laura Dern wore in Jurassic Park. “Go for a more tailored and elevated look: Try pairing them with a pump or heeled sandal instead of a sneaker,” suggests Chartrand. No matter what vibe you’re after, one cue is clear: It’s time to embrace the long and the short of it.",
        "page" : "https://www.ellecanada.com/fashion/trends/bermuda-shorts-are-your-new-summer-wardrobe-staple",
        "image" : "http://localhost:8080/log/burmuda.jpg",
        "date" : "JUN 4, 2020"
    },
    {
        "id": "20200607",
        "author": "Leanne Delap",
        "title" : "The Case for Statement Sleeves This Season",
        "description" : "It was Queen Bey who signalled the arrival of peak puffy sleeves in January when she appeared at the Golden Globes – the kickoff of awards season and, as we all know, the real start of the spring fashion season. Her custom Schiaparelli gown began as a sleek black column but rose up into gigantic, ethereal golden sleeves that formed literal peaks on either side of her ears. Not since Princess Diana’s wedding dress in 1981 have we seen sleeves so big that they could double as inflatable life rafts. There are as many reasons behind the trend as there are iterations of it on the runways. And perhaps the simplest reason influential designers – most notably Hedi Slimane when he was at Saint Laurent – have been channelling Dynasty-era volume for several collections? Social media. “A bigger sleeve will provide the drama if you’re looking for more likes on Instagram,” says long-time Toronto fashion stylist Roslyn Griffith Hall. Awards season was awash in attention-seeking sleeves. Take Sandra Oh in an exquisite champagne tulle and lace Elie Saab gown at the Oscars; the huge arms were like giant swirls of cotton candy. Or Gwyneth Paltrow at the Globes in the much-hated but directional “naked dress” by Fendi; her midriff was bare, but her arms were encased in voluminous sheer sleeves. Another standout at the Globes was fashion darling Dakota Fanning in a pouf-sleeved lavender confection by Christian Dior Haute Couture. “You see it first on the divas,” says Griffith Hall. “The bigger the sleeve the bigger the personality, because a statement sleeve sends a clear message: Go big or go home, baby!”",
        "page" : "https://www.ellecanada.com/fashion/trends/the-case-for-statement-sleeves-this-season",
        "image" : "http://localhost:8080/log/puffy.jpg",
        "date" : "MAR 28 2020"
    },
    {
        "id": "202006232",
        "author": "Erica Ngao",
        "title" : "Tanya Taylor Launches Size Inclusive Swimwear Collection",
        "description" : "Canadian designer Tanya Taylor has launched her first swimwear collection with Summersalt, a direct-to-consumer sustainable brand. The limited edition Brushstrokes capsule blends the label’s signature hand-painted prints with Summersalt’s classic silhouettes.  The suits, which range from size 2 to 22, are produced using the brand’s compressive fabric made with 78 percent recycled polyamide – think recycled plastics, post-consumer materials and nylon waste. “It has been a goal of mine to bring our colourful confidence and high energy happiness to swimwear for a long time,” says Taylor. “It can be an overwhelming and vulnerable experience for many women to bare their bodies and I wanted to work with Summersalt because their dedication to quality and fit make women feel their best.” The capsule includes five swimsuits and one wrap skirt with bow and belt details. A new shape, a wrapped one piece, was created exclusively for the collaboration. All the pieces feature a confetti floral print from Taylor’s spring 2020 collection in a vibrant palette inspired by the diversity and confidence of Miami women. “While this summer is poised to look different from summers’ past, we know our customers can enjoy this collection as they explore their own backyards, from pools, to lakes, to the fire escape,” says Summersalt co-founder Reshma Chamberlin.",
        "page" : "https://www.ellecanada.com/fashion/trends/tanya-taylor-launches-size-inclusive-swimwear-collection",
        "image" : "http://localhost:8080/log/swim.jpg",
        "date" : "MAY 12, 2020"
    },
    {
        "id": "202006231",
        "author": "Hannah Ziegier",
        "title" : "COVID-19 Could Forever Change The Way We Shop",
        "description" : "Whether you have developed a regular online shopping routine or haven’t purchased a single garment since before the pandemic, you have likely given some thought to how COVID-19 will impact how we shop in the longterm. As some retailers announce bankruptcy and others struggle to survive without physical storefronts, the future of fashion is uncertain. Tanya Taylor, Proenza Schouler, SSENSE, Thom Browne, Dries Van Notten, Tory Burch, Erdem Moralioglu, Gabriela Hearst, Nordstrom, Holt Renfrew and Bergdorf Goodman are among international designers and retailers who recently signed an “Open Letter to the Fashion Industry.” The letter proposes new strategies for sustainability and economic relief. This includes putting the Autumn/Winter season back in August/January and Spring/Summer back in February/July, as well as discounting at the end of season to allow for more full-price selling. They are hoping to implement this new strategy by the Autumn/Winter 2020 season. Waste reduction is also a major goal. The letter outlines “less unnecessary product, less waste in fabrics and inventory and less travel,” as key points. The letter ends with a powerful statement: “Working together, we hope these steps will allow our industry to become more responsible for our impact on our customers, on the planet and on the fashion community, and bring back the magic and creativity that has made fashion such an important part of our world.”",
        "page" : "https://www.ellecanada.com/fashion/shopping/covid-19-could-forever-change-the-way-we-shop",
        "image" : "http://localhost:8080/log/future.jpg",
        "date" : "MAY 19, 2020"
    },
    {
        "id": "20200606",
        "author": "The Chriselle Factor",
        "title" : "The Best Blazers To Wear Right Now",
        "description" : "Blazers are having a moment right now and we’re here for it. We love seeing them at work, on the streets, on the ‘gram and while you’re out and about. No longer considered to only be appropriate for “workwear,” here are all of the best blazers we found to get you through the spring and summer in style. No matter what type of blazer it is you’re on the hunt for, it’s so easy to find a modern and updated vibe on the otherwise classic silhouette. So, if you happen to be into the oversized look, the boxy vibe, an under $100 moment, or a belted look – there’s an updated cut and fresh new take on how to style le blazer. PSA: we love styling an oversized blazer over a new spring dress. Keep scrolling to see what our current favorite picks are right now!",
        "page" : "https://thechrisellefactor.com/2020/03/the-best-blazers-to-wear-right-now/",
        "image" : "http://localhost:8080/log/blazer.jpg",
        "date" : "MAR 28 2020"
    },
    {
        "id": "20200605",
        "author": "thefashionmagpie",
        "title" : "Flanerie.",
        "description" : "Over the past few weeks, it has been rare that I have slept through the night. My wakefulness stems sporadically from heat or street noise, often from the apparition-like appearance of my three-year-old at my bedside, and mostly from floods of thought that seem to surge overnight, when I am not distracted by pleas for goldfish and strawberries, the incessant cleaning of the high chair tray, and the limbs and claws and kisses of my two children. I am nearly always awake at 3 a.m. Sometimes I stew. Often I read. Occasionally I leave cryptic, befuddling notes to myself on my iPhone that leave me hunched in decipherment at my desk the following morning. Today, I read in my notes from a couple of sleepless nights ago:",
        "page" : "https://www.thefashionmagpie.com/flanerie/",
        "image" : "http://localhost:8080/log/flanerie.png",
        "date" : "JUN 9 2020"
    }
]